# Entendendo o problema #

In [209]:
#importa a biblioteca pandas
import pandas as pd

In [210]:
#importa o arquivo json com os dados de cada hospedagem
dados = pd.read_json('conteudo/dados_hospedagem.json')

In [211]:
dados.head()

                                         info_moveis
0  {'avaliacao_geral': '10.0', 'experiencia_local...
1  {'avaliacao_geral': '10.0', 'experiencia_local...
2  {'avaliacao_geral': '10.0', 'experiencia_local...
3  {'avaliacao_geral': '10.0', 'experiencia_local...
4  {'avaliacao_geral': '10.0', 'experiencia_local...

In [212]:
#utiliza a função normalize, desacoplando os dados aninhados
dados = pd.json_normalize(dados['info_moveis'])
dados.head()

,avaliacao_geral,experiencia_local,max_hospedes,descricao_local,descricao_vizinhanca,quantidade_banheiros,quantidade_quartos,quantidade_camas,modelo_cama,comodidades,taxa_deposito,taxa_limpeza,preco
0,10.0,--,1,[This clean and comfortable one bedroom sits r...,[Lower Queen Anne is near the Seattle Center (...,"[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, ...","[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, ...","[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, ...","[Real Bed, Futon, Futon, Pull-out Sofa, Real B...","[{Internet,""Wireless Internet"",Kitchen,""Free P...","[$0, $0, $0, $0, $0, $350.00, $350.00, $350.00...","[$0, $0, $0, $20.00, $15.00, $28.00, $35.00, $...","[$110.00, $45.00, $55.00, $52.00, $85.00, $50...."
1,10.0,--,10,[Welcome to the heart of the 'Ballard Brewery ...,"[--, Capital Hill is the heart of Seattle, bor...","[2, 3, 2, 3, 3, 3, 2, 1, 2, 2, 2]","[3, 4, 2, 3, 3, 3, 3, 3, 3, 4, 3]","[5, 6, 8, 3, 3, 5, 4, 5, 6, 7, 4]","[Real Bed, Real Bed, Real Bed, Real Bed, Real ...","[{TV,Internet,""Wireless Internet"",Kitchen,""Fre...","[$500.00, $300.00, $0, $300.00, $300.00, $360....","[$125.00, $100.00, $85.00, $110.00, $110.00, $...","[$350.00, $300.00, $425.00, $300.00, $285.00, ..."
2,10.0,--,11,[New modern house built in 2013. Spectacular ...,[Upper Queen Anne is a charming neighborhood f...,[4],[5],[7],[Real Bed],"[{TV,""Cable TV"",Internet,""Wireless Internet"",""...","[$1,000.00]",[$300.00],[$975.00]
3,10.0,--,12,[Our NW style home is 3200+ sq ft with 3 level...,[The Views from our top floor! Wallingford ha...,"[3, 3, 3, 3, 3, 3, 3, 3]","[6, 6, 5, 5, 5, 5, 4, 4]","[6, 6, 7, 8, 7, 7, 6, 6]","[Real Bed, Real Bed, Real Bed, Real Bed, Real ...","[{Internet,""Wireless Internet"",Kitchen,""Free P...","[$500.00, $500.00, $500.00, $500.00, $500.00, ...","[$225.00, $300.00, $250.00, $250.00, $250.00, ...","[$490.00, $550.00, $350.00, $350.00, $350.00, ..."
4,10.0,--,14,"[Perfect for groups. 2 bedrooms, full bathroom...",[Safeway grocery store within walking distance...,"[2, 3]","[2, 6]","[3, 9]","[Real Bed, Real Bed]","[{TV,Internet,""Wireless Internet"",Kitchen,""Fre...","[$300.00, $2,000.00]","[$40.00, $150.00]","[$200.00, $545.00]"

## Desafios ##

In [213]:
#importa o arquivo json com os dados das vendas dos clientes
dados_clientes = pd.read_json('conteudo/dados_vendas_clientes.json')

In [214]:
dados_clientes.head()

                                        dados_vendas
0  {'Data de venda': '06/06/2022', 'Cliente': ['@...
1  {'Data de venda': '07/06/2022', 'Cliente': ['I...
2  {'Data de venda': '08/06/2022', 'Cliente': ['I...
3  {'Data de venda': '09/06/2022', 'Cliente': ['J...
4  {'Data de venda': '10/06/2022', 'Cliente': ['M...

In [215]:
#normaliza o dataframe, desacoplando os dados aninhados
dados_clientes = pd.json_normalize(dados_clientes['dados_vendas'])
dados_clientes.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [216]:
#importa o arquivo json com os dados do pagamento dos imóveis
dados_condominio = pd.read_json('conteudo/dados_locacao_imoveis.json')
dados_condominio.head()

                                       dados_locacao
0  {'apartamento': 'A101 (blocoAP)', 'datas_combi...
1  {'apartamento': 'A102 (blocoAP)', 'datas_combi...
2  {'apartamento': 'B201 (blocoAP)', 'datas_combi...
3  {'apartamento': 'B202 (blocoAP)', 'datas_combi...
4  {'apartamento': 'C301 (blocoAP)', 'datas_combi...

In [217]:
#normaliza o dataframe, desacoplando os dados aninhados
dados_condominio = pd.json_normalize(dados_condominio['dados_locacao'])
dados_condominio.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),"[01/06/2022, 01/07/2022]","[05/06/2022, 03/07/2022]","[$ 1000,0 reais, $ 2500,0 reais]"
1,A102 (blocoAP),"[02/06/2022, 02/07/2022]","[02/06/2022, 06/07/2022]","[$ 1100,0 reais, $ 2600,0 reais]"
2,B201 (blocoAP),"[03/06/2022, 03/07/2022]","[07/06/2022, 03/07/2022]","[$ 1200,0 reais, $ 2700,0 reais]"
3,B202 (blocoAP),"[04/06/2022, 04/07/2022]","[07/06/2022, 05/07/2022]","[$ 1300,0 reais, $ 2800,0 reais]"
4,C301 (blocoAP),"[05/06/2022, 05/07/2022]","[10/06/2022, 09/07/2022]","[$ 1400,0 reais, $ 2900,0 reais]"

# Dados numéricos #

In [218]:
#imprime uma lista com todas as colunas do dataframe com dados de hospedagem
colunas = list(dados.columns)
colunas

['avaliacao_geral',
 'experiencia_local',
 'max_hospedes',
 'descricao_local',
 'descricao_vizinhanca',
 'quantidade_banheiros',
 'quantidade_quartos',
 'quantidade_camas',
 'modelo_cama',
 'comodidades',
 'taxa_deposito',
 'taxa_limpeza',
 'preco']

In [219]:
#transforma cada item das listas apartir da coluna 3 em linhas no dataframe
dados = dados.explode(colunas[3:])
dados.head()

,avaliacao_geral,experiencia_local,max_hospedes,descricao_local,descricao_vizinhanca,quantidade_banheiros,quantidade_quartos,quantidade_camas,modelo_cama,comodidades,taxa_deposito,taxa_limpeza,preco
0,10.0,--,1,This clean and comfortable one bedroom sits ri...,Lower Queen Anne is near the Seattle Center (s...,1,1,1,Real Bed,"{Internet,""Wireless Internet"",Kitchen,""Free Pa...",$0,$0,$110.00
0,10.0,--,1,Our century old Upper Queen Anne house is loca...,"Upper Queen Anne is a really pleasant, unique ...",1,1,1,Futon,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",$0,$0,$45.00
0,10.0,--,1,Cozy room in two-bedroom apartment along the l...,The convenience of being in Seattle but on the...,1,1,1,Futon,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",$0,$0,$55.00
0,10.0,--,1,Very lovely and cozy room for one. Convenientl...,"Ballard is lovely, vibrant and one of the most...",1,1,1,Pull-out Sofa,"{Internet,""Wireless Internet"",Kitchen,""Free Pa...",$0,$20.00,$52.00
0,10.0,--,1,The “Studio at Mibbett Hollow' is in a Beautif...,--,1,1,1,Real Bed,"{""Wireless Internet"",Kitchen,""Free Parking on ...",$0,$15.00,$85.00

In [220]:
#reseta o index do dataframe, aplicando a mudança 
dados.reset_index(inplace=True, drop=True)
dados.head()

,avaliacao_geral,experiencia_local,max_hospedes,descricao_local,descricao_vizinhanca,quantidade_banheiros,quantidade_quartos,quantidade_camas,modelo_cama,comodidades,taxa_deposito,taxa_limpeza,preco
0,10.0,--,1,This clean and comfortable one bedroom sits ri...,Lower Queen Anne is near the Seattle Center (s...,1,1,1,Real Bed,"{Internet,""Wireless Internet"",Kitchen,""Free Pa...",$0,$0,$110.00
1,10.0,--,1,Our century old Upper Queen Anne house is loca...,"Upper Queen Anne is a really pleasant, unique ...",1,1,1,Futon,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",$0,$0,$45.00
2,10.0,--,1,Cozy room in two-bedroom apartment along the l...,The convenience of being in Seattle but on the...,1,1,1,Futon,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",$0,$0,$55.00
3,10.0,--,1,Very lovely and cozy room for one. Convenientl...,"Ballard is lovely, vibrant and one of the most...",1,1,1,Pull-out Sofa,"{Internet,""Wireless Internet"",Kitchen,""Free Pa...",$0,$20.00,$52.00
4,10.0,--,1,The “Studio at Mibbett Hollow' is in a Beautif...,--,1,1,1,Real Bed,"{""Wireless Internet"",Kitchen,""Free Parking on ...",$0,$15.00,$85.00

In [221]:
#retorna informações como quantidade de dados nulos e tipo de dado para cada coluna no dataframe
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   avaliacao_geral       3818 non-null   object
 1   experiencia_local     3818 non-null   object
 2   max_hospedes          3818 non-null   object
 3   descricao_local       3818 non-null   object
 4   descricao_vizinhanca  3818 non-null   object
 5   quantidade_banheiros  3818 non-null   object
 6   quantidade_quartos    3818 non-null   object
 7   quantidade_camas      3818 non-null   object
 8   modelo_cama           3818 non-null   object
 9   comodidades           3818 non-null   object
 10  taxa_deposito         3818 non-null   object
 11  taxa_limpeza          3818 non-null   object
 12  preco                 3818 non-null   object
dtypes: object(13)
memory usage: 387.9+ KB

In [222]:
#importa a biblioteca numpy
import numpy as np

In [223]:
#atribui a uma variável as colunas que devem ser convertidas para int64
col_numericas = ['max_hospedes', 'quantidade_banheiros', 'quantidade_quartos', 'quantidade_camas']

In [224]:
#converte o tipo de dado das colunas para int64
dados[col_numericas] = dados[col_numericas].astype(np.int64)

In [225]:
#retorna informações do dataframe, agora elas estão como 'int64'
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   avaliacao_geral       3818 non-null   object
 1   experiencia_local     3818 non-null   object
 2   max_hospedes          3818 non-null   int64
 3   descricao_local       3818 non-null   object
 4   descricao_vizinhanca  3818 non-null   object
 5   quantidade_banheiros  3818 non-null   int64
 6   quantidade_quartos    3818 non-null   int64
 7   quantidade_camas      3818 non-null   int64
 8   modelo_cama           3818 non-null   object
 9   comodidades           3818 non-null   object
 10  taxa_deposito         3818 non-null   object
 11  taxa_limpeza          3818 non-null   object
 12  preco                 3818 non-null   object
dtypes: int64(4), object(9)
memory usage: 387.9+ KB

In [226]:
#converte os dados da coluna 'avaliacao_geral' para o tipo float64
dados['avaliacao_geral'] = dados['avaliacao_geral'].astype(np.float64)

In [227]:
#retorna informações das colunas do dataframe
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   avaliacao_geral       3162 non-null   float64
 1   experiencia_local     3818 non-null   object
 2   max_hospedes          3818 non-null   int64
 3   descricao_local       3818 non-null   object
 4   descricao_vizinhanca  3818 non-null   object
 5   quantidade_banheiros  3818 non-null   int64
 6   quantidade_quartos    3818 non-null   int64
 7   quantidade_camas      3818 non-null   int64
 8   modelo_cama           3818 non-null   object
 9   comodidades           3818 non-null   object
 10  taxa_deposito         3818 non-null   object
 11  taxa_limpeza          3818 non-null   object
 12  preco                 3818 non-null   object
dtypes: float64(1), int64(4), object(8)
memory usage: 387.9+ KB

**não é possível alterar o tipo de dado das últimas colunas devido ao caractere '$'**

In [228]:
dados['preco']

0       $110.00
1        $45.00
2        $55.00
3        $52.00
4        $85.00
         ...
3813    $299.00
3814    $199.00
3815    $400.00
3816    $250.00
3817    $350.00
Name: preco, Length: 3818, dtype: object

In [229]:
#utiliza a função replace para substituir os caracteres '$' e ',', e a função strip para remover os espaços
dados['preco'] = dados['preco'].apply(lambda x: x.replace('$', '').replace(',', '').strip())

In [230]:
#agora é possível converter o tipo de dado da coluna 'preco' para 'float64' pois não temos mais o '$'
dados['preco'] = dados['preco'].astype(np.float64)

In [231]:
#retorna informações sobre as colunas do dataframe
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   avaliacao_geral       3162 non-null   float64
 1   experiencia_local     3818 non-null   object
 2   max_hospedes          3818 non-null   int64
 3   descricao_local       3818 non-null   object
 4   descricao_vizinhanca  3818 non-null   object
 5   quantidade_banheiros  3818 non-null   int64
 6   quantidade_quartos    3818 non-null   int64
 7   quantidade_camas      3818 non-null   int64
 8   modelo_cama           3818 non-null   object
 9   comodidades           3818 non-null   object
 10  taxa_deposito         3818 non-null   object
 11  taxa_limpeza          3818 non-null   object
 12  preco                 3818 non-null   float64
dtypes: float64(2), int64(4), object(7)
memory usage: 387.9+ KB

In [232]:
#remove todos os caracteres, vírgulas e espaços da coluna 'taxa_deposito' e 'taxa'limpeza'
dados[['taxa_deposito', 'taxa_limpeza']] = dados[['taxa_deposito', 'taxa_limpeza']].applymap(lambda x: x.replace('$', '').replace(',', '').strip())

C:\Users\felip\AppData\Local\Temp\ipykernel_37344\2185317069.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  dados[['taxa_deposito', 'taxa_limpeza']] = dados[['taxa_deposito', 'taxa_limpeza']].applymap(lambda x: x.replace('$', '').replace(',', '').strip())

In [233]:
#agora podemos converter os dados para o tipo 'float64'
dados[['taxa_deposito', 'taxa_limpeza']] =  dados[['taxa_deposito', 'taxa_limpeza']].astype(np.float64)

In [234]:
#agora os dados numéricos são do tipo float
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   avaliacao_geral       3162 non-null   float64
 1   experiencia_local     3818 non-null   object
 2   max_hospedes          3818 non-null   int64
 3   descricao_local       3818 non-null   object
 4   descricao_vizinhanca  3818 non-null   object
 5   quantidade_banheiros  3818 non-null   int64
 6   quantidade_quartos    3818 non-null   int64
 7   quantidade_camas      3818 non-null   int64
 8   modelo_cama           3818 non-null   object
 9   comodidades           3818 non-null   object
 10  taxa_deposito         3818 non-null   float64
 11  taxa_limpeza          3818 non-null   float64
 12  preco                 3818 non-null   float64
dtypes: float64(4), int64(4), object(5)
memory usage: 387.9+ KB

## Desafios ##

**Projeto desafio 1: vendas online**

*Remover os dados em listas dentro do DataFrame;

*Verificar os tipos de dados;

*Identificar colunas numéricas;

*Transformar a coluna numérica para o tipo numérico.

In [235]:
dados_clientes.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [236]:
#transforma as listas dento do dataframe em novas linhas
dados_clientes = dados_clientes.explode(['Cliente', 'Valor da compra'][1:])

In [237]:
#descarta o index antigo e o reseta para formatação correta
dados_clientes.reset_index(drop=True, inplace=True)

In [238]:
dados_clientes.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","R$ 836,5"
1,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","R$ 573,33"
2,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","R$ 392,8"
3,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","R$ 512,34"
4,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","R$ 825,31"

In [239]:
#remove os caracteres, vírgulas e espaços da coluna 'valor da compra'
dados_clientes['Valor da compra'] = dados_clientes['Valor da compra'].apply(lambda x: x.replace('R$ ', '').replace(',', '').strip())

In [240]:
#agora os dados numéricos são do tipo float
dados_clientes['Valor da compra'].astype(np.float64)

0      8365.0
1     57333.0
2      3928.0
3     51234.0
4     82531.0
5     16807.0
6     33918.0
7     31469.0
8     68205.0
9     38634.0
10    62265.0
11    63079.0
12     3903.0
13    75916.0
14    33447.0
15    67878.0
16    31424.0
17    31115.0
18    89916.0
19    88524.0
Name: Valor da compra, dtype: float64

In [241]:
#agora os dados estão formatados corretamente
dados_clientes.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...",8365
1,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...",57333
2,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...",3928
3,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...",51234
4,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...",82531

**Projeto desafio 2: administração de condomínios**

*Remover os dados em listas dentro do DataFrame;

*Verificar os tipos de dados;

*Identificar colunas numéricas;

*Transformar a coluna numérica para o tipo numérico.

In [242]:
dados_condominio.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),"[01/06/2022, 01/07/2022]","[05/06/2022, 03/07/2022]","[$ 1000,0 reais, $ 2500,0 reais]"
1,A102 (blocoAP),"[02/06/2022, 02/07/2022]","[02/06/2022, 06/07/2022]","[$ 1100,0 reais, $ 2600,0 reais]"
2,B201 (blocoAP),"[03/06/2022, 03/07/2022]","[07/06/2022, 03/07/2022]","[$ 1200,0 reais, $ 2700,0 reais]"
3,B202 (blocoAP),"[04/06/2022, 04/07/2022]","[07/06/2022, 05/07/2022]","[$ 1300,0 reais, $ 2800,0 reais]"
4,C301 (blocoAP),"[05/06/2022, 05/07/2022]","[10/06/2022, 09/07/2022]","[$ 1400,0 reais, $ 2900,0 reais]"

In [243]:
#atribui a uma variável uma lista com as colunas do dataframe 
colunas_condominio = list(dados_condominio.columns)

In [244]:
#transforma as listas dento do dataframe em novas linhas a partir da coluna 1
dados_condominio = dados_condominio.explode(colunas_condominio[1:])

In [245]:
#descarta o index antigo e o reseta para formatação correta
dados_condominio.reset_index(drop=True, inplace=True)

In [246]:
dados_condominio.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),01/06/2022,05/06/2022,"$ 1000,0 reais"
1,A101 (blocoAP),01/07/2022,03/07/2022,"$ 2500,0 reais"
2,A102 (blocoAP),02/06/2022,02/06/2022,"$ 1100,0 reais"
3,A102 (blocoAP),02/07/2022,06/07/2022,"$ 2600,0 reais"
4,B201 (blocoAP),03/06/2022,07/06/2022,"$ 1200,0 reais"

In [247]:
#a coluna 'valor aluguel' permanece como uma string
dados_condominio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     object
dtypes: object(4)
memory usage: 1.1+ KB

In [248]:
#remove os caracteres, vírgulas e espaços da coluna 'valor aluguel'
dados_condominio['valor_aluguel'] = dados_condominio['valor_aluguel'].apply(lambda x: x.replace('$ ', '').replace(',', '').replace(' reais', ''))

In [249]:
#agora os dados estão formatados corretamente
dados_condominio.head()

      apartamento datas_combinadas_pagamento datas_de_pagamento valor_aluguel
0  A101 (blocoAP)                 01/06/2022         05/06/2022         10000
1  A101 (blocoAP)                 01/07/2022         03/07/2022         25000
2  A102 (blocoAP)                 02/06/2022         02/06/2022         11000
3  A102 (blocoAP)                 02/07/2022         06/07/2022         26000
4  B201 (blocoAP)                 03/06/2022         07/06/2022         12000

# Dados textuais

**Tokenização:** divide um texto em unidades menores

In [250]:
# imprime os dados da coluna 'descricao_local' em formato de string, e diminui as letras maísculas
dados['descricao_local'] = dados['descricao_local'].str.lower()

In [251]:
dados.head()

,avaliacao_geral,experiencia_local,max_hospedes,descricao_local,descricao_vizinhanca,quantidade_banheiros,quantidade_quartos,quantidade_camas,modelo_cama,comodidades,taxa_deposito,taxa_limpeza,preco
0,10.0,--,1,this clean and comfortable one bedroom sits ri...,Lower Queen Anne is near the Seattle Center (s...,1,1,1,Real Bed,"{Internet,""Wireless Internet"",Kitchen,""Free Pa...",0.0,0.0,110.0
1,10.0,--,1,our century old upper queen anne house is loca...,"Upper Queen Anne is a really pleasant, unique ...",1,1,1,Futon,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",0.0,0.0,45.0
2,10.0,--,1,cozy room in two-bedroom apartment along the l...,The convenience of being in Seattle but on the...,1,1,1,Futon,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",0.0,0.0,55.0
3,10.0,--,1,very lovely and cozy room for one. convenientl...,"Ballard is lovely, vibrant and one of the most...",1,1,1,Pull-out Sofa,"{Internet,""Wireless Internet"",Kitchen,""Free Pa...",0.0,20.0,52.0
4,10.0,--,1,the “studio at mibbett hollow' is in a beautif...,--,1,1,1,Real Bed,"{""Wireless Internet"",Kitchen,""Free Parking on ...",0.0,15.0,85.0

**Removendo caracteres com Regex**

*Aprenda mais de Regex em: https://www.alura.com.br/artigos/principais-casos-uso-regex-para-tratamento-dados*

In [252]:
#seleciona a linha 3110 da coluna 'descricao_local'
dados['descricao_local'][3110]

"our charming home in fabulous upper fremont is a classic craftsman w/ 3 br and 2 ba, fully updated systems, original woodwork, great art, & comfy beds. light filled cook's kitchen with big  deck & bbq. it is mere steps to a grocery market, restaurants, 3 cafes, public transportation & the woodland park zoo. this is a classically beautiful craftsman home with modern updates. if you have extra guests, we have an apartment on the ground floor that is available. you can view it at https://www.airbnb.com/rooms/6516775 for families, we are close to the zoo, greenlake and all that fremont and wallingford offer. for eating out, we are within blocks of restaurant roux (cajun), paseo (famous caribbean sandwiches), rock creek (seafood), via tribunali (pizza), uneeda (burgers), pecado bueno (mexican) and ha! (american bistro with bar). further down the hill in fremont, there are many more choices. for coffee there are three cafes: cafe vita, lighthouse roasters or vif, a coffee and wine bar with g"

In [253]:
# Utiliza o Regex para remover qualquer caractere que não esteja entre a-z, A-Z, e 0-9
dados['descricao_local'] = dados['descricao_local'].str.replace('[^a-zA-Z0-9\-\']', ' ', regex=True)

<>:2: SyntaxWarning: invalid escape sequence '\-'
<>:2: SyntaxWarning: invalid escape sequence '\-'
C:\Users\felip\AppData\Local\Temp\ipykernel_37344\2227568410.py:2: SyntaxWarning: invalid escape sequence '\-'
  dados['descricao_local'] = dados['descricao_local'].str.replace('[^a-zA-Z0-9\-\']', ' ', regex=True)

In [254]:
# Remove os hifens que não estão conectando palavras compostas na coluna 'descricao_local' do dataframe 'dados'.
dados['descricao_local'] = dados['descricao_local'].str.replace('(?<!\w)-(?!\w)', ' ', regex=True)

<>:2: SyntaxWarning: invalid escape sequence '\w'
<>:2: SyntaxWarning: invalid escape sequence '\w'
C:\Users\felip\AppData\Local\Temp\ipykernel_37344\1102479796.py:2: SyntaxWarning: invalid escape sequence '\w'
  dados['descricao_local'] = dados['descricao_local'].str.replace('(?<!\w)-(?!\w)', ' ', regex=True)

In [255]:
dados['descricao_local'].head()

0    this clean and comfortable one bedroom sits ri...
1    our century old upper queen anne house is loca...
2    cozy room in two-bedroom apartment along the l...
3    very lovely and cozy room for one  convenientl...
4    the  studio at mibbett hollow' is in a beautif...
Name: descricao_local, dtype: object

In [256]:
# Transforma as strings em listas de palavras individuais
dados['descricao_local'] = dados['descricao_local'].str.split()
dados['descricao_local'].head()

0    [this, clean, and, comfortable, one, bedroom, ...
1    [our, century, old, upper, queen, anne, house,...
2    [cozy, room, in, two-bedroom, apartment, along...
3    [very, lovely, and, cozy, room, for, one, conv...
4    [the, studio, at, mibbett, hollow', is, in, a,...
Name: descricao_local, dtype: object

tratando a coluna comodidades

In [257]:
dados['comodidades'].head()

0    {Internet,"Wireless Internet",Kitchen,"Free Pa...
1    {TV,Internet,"Wireless Internet",Kitchen,"Free...
2    {TV,Internet,"Wireless Internet",Kitchen,"Free...
3    {Internet,"Wireless Internet",Kitchen,"Free Pa...
4    {"Wireless Internet",Kitchen,"Free Parking on ...
Name: comodidades, dtype: object

In [258]:
dados['comodidades'] = dados['comodidades'].str.replace('\{|}|\"', '', regex=True)

<>:1: SyntaxWarning: invalid escape sequence '\{'
<>:1: SyntaxWarning: invalid escape sequence '\{'
C:\Users\felip\AppData\Local\Temp\ipykernel_37344\4110219483.py:1: SyntaxWarning: invalid escape sequence '\{'
  dados['comodidades'] = dados['comodidades'].str.replace('\{|}|\"', '', regex=True)

In [259]:
dados['comodidades'] = dados['comodidades'].str.split(',')
dados['comodidades']

0       [Internet, Wireless Internet, Kitchen, Free Pa...
1       [TV, Internet, Wireless Internet, Kitchen, Fre...
2       [TV, Internet, Wireless Internet, Kitchen, Fre...
3       [Internet, Wireless Internet, Kitchen, Free Pa...
4       [Wireless Internet, Kitchen, Free Parking on P...
                              ...
3813    [TV, Cable TV, Internet, Wireless Internet, Ai...
3814    [TV, Cable TV, Internet, Wireless Internet, Ki...
3815    [TV, Cable TV, Internet, Wireless Internet, Ai...
3816    [TV, Cable TV, Internet, Wireless Internet, Ai...
3817    [TV, Internet, Wireless Internet, Kitchen, Fre...
Name: comodidades, Length: 3818, dtype: object

**Desafio: faça o processo de tokenização para a coluna descricao_vizinhanca presente no conjunto de dados dados_hospedagem.json.**

In [260]:
dados['descricao_vizinhanca'][1]

"Upper Queen Anne is a really pleasant, unique little oasis in Seattle. It's minutes away from Seattle center and super close to downtown, but still manages to be a friendly, interesting, and safe-feeling neighborhood with kick-ass shops, cafes, restaurants and grocery stores all within short walking distance. There are no shortages of nice parks with extraordinary views of the city too."

In [261]:
dados['descricao_vizinhanca'] = dados['descricao_vizinhanca'].str.lower()

In [262]:
dados['descricao_vizinhanca'] = dados['descricao_vizinhanca'].str.replace('[^a-zA-Z0-9\-\']', ' ', regex=True)

<>:1: SyntaxWarning: invalid escape sequence '\-'
<>:1: SyntaxWarning: invalid escape sequence '\-'
C:\Users\felip\AppData\Local\Temp\ipykernel_37344\926935228.py:1: SyntaxWarning: invalid escape sequence '\-'
  dados['descricao_vizinhanca'] = dados['descricao_vizinhanca'].str.replace('[^a-zA-Z0-9\-\']', ' ', regex=True)

In [263]:
dados['descricao_vizinhanca'] = dados['descricao_vizinhanca'].str.replace('(?<!\w)-(?!\w)', '', regex=True)

<>:1: SyntaxWarning: invalid escape sequence '\w'
<>:1: SyntaxWarning: invalid escape sequence '\w'
C:\Users\felip\AppData\Local\Temp\ipykernel_37344\1847573177.py:1: SyntaxWarning: invalid escape sequence '\w'
  dados['descricao_vizinhanca'] = dados['descricao_vizinhanca'].str.replace('(?<!\w)-(?!\w)', '', regex=True)

In [264]:
dados['descricao_vizinhanca'][1]

"upper queen anne is a really pleasant  unique little oasis in seattle  it's minutes away from seattle center and super close to downtown  but still manages to be a friendly  interesting  and safe-feeling neighborhood with kick-ass shops  cafes  restaurants and grocery stores all within short walking distance  there are no shortages of nice parks with extraordinary views of the city too "

In [265]:
dados['descricao_vizinhanca'] = dados['descricao_vizinhanca'].str.split()

In [266]:
dados['descricao_vizinhanca'][1]

['upper',
 'queen',
 'anne',
 'is',
 'a',
 'really',
 'pleasant',
 'unique',
 'little',
 'oasis',
 'in',
 'seattle',
 "it's",
 'minutes',
 'away',
 'from',
 'seattle',
 'center',
 'and',
 'super',
 'close',
 'to',
 'downtown',
 'but',
 'still',
 'manages',
 'to',
 'be',
 'a',
 'friendly',
 'interesting',
 'and',
 'safe-feeling',
 'neighborhood',
 'with',
 'kick-ass',
 'shops',
 'cafes',
 'restaurants',
 'and',
 'grocery',
 'stores',
 'all',
 'within',
 'short',
 'walking',
 'distance',
 'there',
 'are',
 'no',
 'shortages',
 'of',
 'nice',
 'parks',
 'with',
 'extraordinary',
 'views',
 'of',
 'the',
 'city',
 'too']

## Desafio

**Desafio 1: vendas online.**

Devido a uma instabilidade no site da empresa, tivemos problemas com os nomes dos clientes durante o salvamento. Isso resultou em uma coluna de nomes de clientes com uma mistura de letras, maiúsculas e minúsculas, números e outros caracteres.

Sabendo disso, manipule os textos presentes na coluna Cliente para que seja obtido como resultado os nomes dos clientes em letras minúsculas, com a ausência de caracteres especiais ou números.

In [267]:
dados_clientes.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...",8365
1,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...",57333
2,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...",3928
3,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...",51234
4,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...",82531

In [268]:
dados_clientes = dados_clientes.explode('Cliente')
dados_clientes.head()

  Data de venda             Cliente Valor da compra
0    06/06/2022     @ANA _LUCIA 321            8365
0    06/06/2022  DieGO ARMANDIU 210            8365
0    06/06/2022  DieGO ARMANDIU 210            8365
0    06/06/2022  DieGO ARMANDIU 210            8365
1    06/06/2022     @ANA _LUCIA 321           57333

In [269]:
dados_clientes['Cliente'] = dados_clientes['Cliente'].str.lower()

In [270]:
dados_clientes['Cliente'].str.replace('[^a-z ]', ' ', regex=True)

0         ana  lucia
0     diego armandiu
0     diego armandiu
0     diego armandiu
1         ana  lucia
             ...
18     thiago fritzz
19       maria julia
19       pedro pasco
19      paulo castro
19     thiago fritzz
Name: Cliente, Length: 80, dtype: object

In [271]:
dados_clientes['Cliente'] = dados_clientes['Cliente'].str.replace('[^a-z ]', '', regex=True).str.strip()

In [272]:
dados_clientes.head()

  Data de venda         Cliente Valor da compra
0    06/06/2022       ana lucia            8365
0    06/06/2022  diego armandiu            8365
0    06/06/2022  diego armandiu            8365
0    06/06/2022  diego armandiu            8365
1    06/06/2022       ana lucia           57333

**Desafio 2: administração de condomínio**

Buscando explicar a organização da identificação dos apartamentos, durante a criação do conjunto de dados, foi adicionado o texto (blocoAP). Esse texto informa que os nomes dos apartamentos estão organizados com a letra do bloco seguida do número do apartamento. No entanto, isso não traz nenhuma informação para nossos dados, sendo interessante realizar a remoção desse texto no conjunto de dados.

In [273]:
dados_condominio.head()

      apartamento datas_combinadas_pagamento datas_de_pagamento valor_aluguel
0  A101 (blocoAP)                 01/06/2022         05/06/2022         10000
1  A101 (blocoAP)                 01/07/2022         03/07/2022         25000
2  A102 (blocoAP)                 02/06/2022         02/06/2022         11000
3  A102 (blocoAP)                 02/07/2022         06/07/2022         26000
4  B201 (blocoAP)                 03/06/2022         07/06/2022         12000

In [274]:
dados_condominio['apartamento'] = dados_condominio['apartamento'].str.replace('(blocoAP)', '')

In [275]:
dados_condominio.head()

  apartamento datas_combinadas_pagamento datas_de_pagamento valor_aluguel
0       A101                  01/06/2022         05/06/2022         10000
1       A101                  01/07/2022         03/07/2022         25000
2       A102                  02/06/2022         02/06/2022         11000
3       A102                  02/07/2022         06/07/2022         26000
4       B201                  03/06/2022         07/06/2022         12000

# Dados de Tempo

In [276]:
dados_moveis = pd.read_json('conteudo\moveis_disponiveis.json')
dados_moveis.head()

<>:1: SyntaxWarning: invalid escape sequence '\m'
<>:1: SyntaxWarning: invalid escape sequence '\m'
C:\Users\felip\AppData\Local\Temp\ipykernel_37344\3582947892.py:1: SyntaxWarning: invalid escape sequence '\m'
  dados_moveis = pd.read_json('conteudo\moveis_disponiveis.json')

    id        data  vaga_disponivel preco
0  857  2016-01-04            False  None
1  857  2016-01-05            False  None
2  857  2016-01-06            False  None
3  857  2016-01-07            False  None
4  857  2016-01-08            False  None

In [277]:
dados_moveis.info()

<class 'pandas.core.frame.DataFrame'>
Index: 365000 entries, 0 to 364999
Data columns (total 4 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   id               365000 non-null  int64
 1   data             365000 non-null  object
 2   vaga_disponivel  365000 non-null  bool
 3   preco            270547 non-null  object
dtypes: bool(1), int64(1), object(2)
memory usage: 11.5+ MB

In [278]:
dados_moveis['data'] = pd.to_datetime(dados_moveis['data'],)

In [279]:
#a coluna 'data' agora está como datetime
dados_moveis.info()

<class 'pandas.core.frame.DataFrame'>
Index: 365000 entries, 0 to 364999
Data columns (total 4 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   id               365000 non-null  int64
 1   data             365000 non-null  datetime64[ns]
 2   vaga_disponivel  365000 non-null  bool
 3   preco            270547 non-null  object
dtypes: bool(1), datetime64[ns](1), int64(1), object(1)
memory usage: 11.5+ MB

In [280]:
dados_moveis.head()

    id       data  vaga_disponivel preco
0  857 2016-01-04            False  None
1  857 2016-01-05            False  None
2  857 2016-01-06            False  None
3  857 2016-01-07            False  None
4  857 2016-01-08            False  None

In [281]:
dados_moveis['data'].dt.strftime('%Y-%m')

0         2016-01
1         2016-01
2         2016-01
3         2016-01
4         2016-01
           ...
364995    2016-12
364996    2016-12
364997    2016-12
364998    2017-01
364999    2017-01
Name: data, Length: 365000, dtype: object

In [282]:
subset = dados_moveis.groupby(dados_moveis['data'].dt.strftime('%Y-%m'))['vaga_disponivel'].sum()
subset

data
2016-01    16543
2016-02    20128
2016-03    23357
2016-04    22597
2016-05    23842
2016-06    23651
2016-07    22329
2016-08    22529
2016-09    22471
2016-10    23765
2016-11    23352
2016-12    24409
2017-01     1574
Name: vaga_disponivel, dtype: int64

## Desafio

faça a transformação dos dados na coluna preco do conjunto de dados moveis_disponiveis.json para o tipo numérico float64. 

Lembrando que, antes de fazer isso, você precisa preencher os valores vazios na coluna por um valor. 

Uma sugestão: substitua pela string '0.0'.

In [283]:
import numpy as np

In [284]:
dados_moveis

          id       data  vaga_disponivel    preco
0        857 2016-01-04            False     None
1        857 2016-01-05            False     None
2        857 2016-01-06            False     None
3        857 2016-01-07            False     None
4        857 2016-01-08            False     None
...      ...        ...              ...      ...
364995  3279 2016-12-29             True  $140.00
364996  3279 2016-12-30             True  $140.00
364997  3279 2016-12-31             True  $140.00
364998  3279 2017-01-01             True  $140.00
364999  3279 2017-01-02            False     None

[365000 rows x 4 columns]

In [285]:
dados_moveis['preco'].fillna('0.0', inplace=True)

In [286]:
dados_moveis['preco'] = dados_moveis['preco'].apply(lambda x: x.replace('$', '').replace(',', ''))

In [287]:
dados_moveis['preco'].astype(np.float64)

0           0.0
1           0.0
2           0.0
3           0.0
4           0.0
          ...
364995    140.0
364996    140.0
364997    140.0
364998    140.0
364999      0.0
Name: preco, Length: 365000, dtype: float64

# Desafio Final

**Desafio 1:** Na coluna Data de venda, temos datas em formato 'dia/mês/ano' (dd/mm/AAAA). Transforme esses dados para o tipo datetime e busque uma forma de visualização de subconjunto que possa contribuir no objetivo do contexto que os dados estão inseridos.

Se você não lembra o problema do projeto desafio 1, vou deixar abaixo o texto da situação para facilitar o encontro da informação:


O objetivo desse projeto é realizar uma análise dos resultados de um evento com os clientes de uma empresa de vendas online. 

Foi coletado um conjunto de dados que contém os clientes que mais gastaram com produtos dentro de 5 dias de vendas, que é o período de duração do evento. 

Essa análise vai identificar o cliente com a maior compra na semana, que irá receber um prêmio da loja, e posteriormente, ela pode ajudar a empresa a criar novas estratégias para atrair mais clientes.

In [322]:
dados_clientes.head(25)

  Data de venda         Cliente Valor da compra
0    2022-06-06       ana lucia            8365
0    2022-06-06  diego armandiu            8365
0    2022-06-06  diego armandiu            8365
0    2022-06-06  diego armandiu            8365
1    2022-06-06       ana lucia           57333
1    2022-06-06  diego armandiu           57333
1    2022-06-06  diego armandiu           57333
1    2022-06-06  diego armandiu           57333
2    2022-06-06       ana lucia            3928
2    2022-06-06  diego armandiu            3928
2    2022-06-06  diego armandiu            3928
2    2022-06-06  diego armandiu            3928
3    2022-06-06       ana lucia           51234
3    2022-06-06  diego armandiu           51234
3    2022-06-06  diego armandiu           51234
3    2022-06-06  diego armandiu           51234
4    2022-07-06  isabely joanes           82531
4    2022-07-06  isabely joanes           82531
4    2022-07-06  isabely joanes           82531
4    2022-07-06  isabely joanes           82531
5    2022-07-06  isabely joanes           16807
5    2022-07-06  isabely joanes           16807
5    2022-07-06  isabely joanes           16807
5    2022-07-06  isabely joanes           16807
6    2022-07-06  isabely joanes           33918

In [288]:
dados_clientes.info()

<class 'pandas.core.frame.DataFrame'>
Index: 80 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    80 non-null     object
 1   Cliente          80 non-null     object
 2   Valor da compra  80 non-null     object
dtypes: object(3)
memory usage: 2.5+ KB

In [289]:
dados_clientes['Data de venda'] = pd.to_datetime(dados_clientes['Data de venda'])

In [325]:
dados_clientes['Valor da compra'] = dados_clientes['Valor da compra'].astype(np.float64)

In [337]:
total_por_cliente = dados_clientes.groupby('Cliente')['Valor da compra'].sum().reset_index().sort_values(by='Valor da compra', ascending=False)
total_por_cliente

          Cliente  Valor da compra
2  isabely joanes         891083.0
5     maria julia         784411.0
4  julya meireles         645510.0
1  diego armandiu         362580.0
6    paulo castro         240979.0
7     pedro pasco         240979.0
8   thiago fritzz         240979.0
3     joo gabriel         232183.0
0       ana lucia         120860.0

**Desafio 2:** Nas colunas datas_de_pagamento e datas_combinadas_pagamento, temos datas em formato 'dia/mês/ano' (dd/mm/AAAA). Transforme esses dados para o tipo datetime e busque uma forma de visualização de subconjunto que possa contribuir no objetivo do contexto que os dados estão inseridos.

A administração de condomínios é uma tarefa que requer muita atenção e organização. Entre as diversas responsabilidades da gestão está o recebimento dos aluguéis dos locatários. Para garantir uma boa saúde financeira do empreendimento, é fundamental que esses pagamentos sejam feitos de forma regular e pontual. No entanto, sabemos que nem sempre isso acontece. Pensando nisso, proponho um desafio de tratamento de dados com o objetivo de analisar o atraso no pagamento de aluguéis no condomínio fictício de alguns moradores.

In [299]:
dados_condominio.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel,dias_de_atraso
0,A101,2022-06-01,2022-06-05,10000,4 days
1,A101,2022-07-01,2022-07-03,25000,2 days
2,A102,2022-06-02,2022-06-02,11000,0 days
3,A102,2022-07-02,2022-07-06,26000,4 days
4,B201,2022-06-03,2022-06-07,12000,4 days

In [292]:
dados_condominio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     object
dtypes: object(4)
memory usage: 1.1+ KB

In [293]:
dados_condominio['datas_combinadas_pagamento'] = pd.to_datetime(dados_condominio['datas_combinadas_pagamento'], format='%d/%m/%Y')
dados_condominio['datas_de_pagamento'] = pd.to_datetime(dados_condominio['datas_de_pagamento'], format='%d/%m/%Y')

In [296]:
dados_condominio['dias_de_atraso'] = dados_condominio['datas_de_pagamento'] - dados_condominio['datas_combinadas_pagamento']

In [309]:
dados_condominio['dias_de_atraso'] = dados_condominio['dias_de_atraso'].dt.days

In [317]:
pagamentos_atrasados = dados_condominio[dados_condominio['dias_de_atraso'] > 0].sort_values(by='dias_de_atraso', ascending=False)
pagamentos_atrasados.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel,dias_de_atraso
25,G701,2022-07-13,2022-07-20,12000,7
15,D402,2022-07-08,2022-07-14,14000,6
11,C302,2022-07-06,2022-07-12,12000,6
24,G701,2022-06-13,2022-06-19,22000,6
20,F601,2022-06-11,2022-06-17,20000,6